{
	"version":1,
	"thumbImg":"https://drewingde.s3.us-west-1.amazonaws.com/blog/2018/2/11/So%2CYouWantToBeADesigner%3F-w390.png",
	"postImg":"https://drewingde.s3.us-west-1.amazonaws.com/blog/2018/2/11/So%2CYouWantToBeADesigner%3F-w800.png",
	"filename":"index.html",
	"id":349,
	"date":"2018-2-11 23:33:48",
	"url":"https://drewing.de/blog/2018/2/11/so-you-want-to-be-a-designer/",
	"title":"So, You Want To Be A Designer?",
	"title_plain":"so-you-want-to-be-a-designer",
	"excerpt":"Design attracts people for a wide variety of reasons. Some of the more frequently name ...",
	"content":"<a href=\"https://drewingde.s3.us-west-1.amazonaws.com/blog/2018/2/11/So%2CYouWantToBeADesigner%3F.png\"><img src=\"https://drewingde.s3.us-west-1.amazonaws.com/blog/2018/2/11/So%2CYouWantToBeADesigner%3F-w800.png\" width=\"800\"></a><h1>So, you want to be a designer?</h1>  <p><em>tl;dr: No, you don't.</em></p>  <h2>Motive</h2>  <p>Design attracts people for a wide variety of reasons. Some of the more frequently named motives are:</p>  <ol> <li>You enjoy drawing, photography, etc.</li> <li>You want to improve things, optimize their usability</li> <li>You think designers earn a lot of money</li> </ol>  <h2>Reality</h2>  <p>So far, so naive - let's have a closer look:</p>  <h2>1. You enjoy drawing, photography, etc.</h2>  <p>Drawing, like some other design activities, is an activity providing immediate feedback, succeeding at it is in the reach of many people and it is so engrossing that other needs become negligible. The state of mind emerging from these activities is known as &quot;flow&quot; - and it's a pretty strong intrinsic motivation (see &quot;Flow&quot; by Mihaly Csikszentmihalyi). Though you might not be aware of it, chances are that the state flow is what you are after. If you already acquired some proficiency in the given discipline also the positive feedback from other people might influence you.</p><p>Unfortunately the reality of a design job is … different, to say the least:</p>  <ul> <li>Requirements are vague (most clients can't put in words what they want)</li> <li>No matter how good you are, you'll get your ideas killed and mutilated on a regular basis (see <a href=\"https://clientsfromhell.net/\">https://clientsfromhell.net/</a> for some insights).</li> <li>Constant disturbances in the form of new requirements or questions from clients and suppliers are perpetually coming in via phone calls. Everything is urgent. This makes concentration a very rare state of mind.</li> <li>Feedback is consistently negative, since the client is (almost) never able to  articulate his expectations until he actually sees a finished design (that's why mood boards are useful)</li> </ul>  <p>In other words: The state flow and the positive feedback, which might have been the main driver for your decision, are absent in the professional life of a designer.</p>  <h2>2. You want to improve things, optimize their usability</h2>  <p>Maybe you've read Don Norman's &quot;The Psychology Of Everyday Things&quot;. Or maybe you think there are a lot of sub optimal products on the market and you could improve them.</p><p>While this motive is a bit more mature, it still misses the point: A product is a means to get other peoples money - at least if seen from the manufacturers perspective. No more. No less. As soon as it serves this purpose, every further effort invested in the product is a loss for the manufacturer (unless the additional effort leads to even more obscene profits for the company).</p><p>The layman buyer on the other hand usually has very limited resources to assess the quality of any given product. So he goes for the product fitting his purse - and with the upper 1% of the society stripping the rest of us of ever bigger parts of our livelihoods, this results in products getting worse - by design. While Norman's books are inherently brilliant, they are mainly approaching the subject from the user's perspective. Unfortunately this point of view is only marginally relevant if you have to make a living in a &quot;free&quot; market economy.</p>  <h2>3. You think designers earn a lot of money</h2>  <p>If you're reading articles about Jony Ive or other designers in the limelight, you might get the impression that the job pays well. While it's true that there are a chosen few who are actually making a fortune, the most designers are barely making a living.</p><p>Studying design (or architecture) is one of the worst economic decisions you can make. It's one of the most expensive fields for the students and once you graduate the income for most is hardly more than that of a mediocre craftsman. While I wouldn't recommend to choose your career based on salary alone, I can still guarantee that it will kill your motivation once you see that even your dimmest classmates will be far above you in terms of finance.</p>  <h1>A way out</h1>  <p>Since there is no designers anonymous finding a way out of the chaos can proof tricky. Depending on your age and skills there are different options.</p><p>If you haven't already started do yourself a favour and keep your design aspiration where they can't hurt you: your spare time. If you're still in your twenties you might get back to university and study something that actually pays. My advice would be engineering, computer science or medicine. If you are living in Germany you might also become a teacher.</p>  <p>Having done some programming while still being a designer, I was able to switch to being a full time software developer after seven years as a designer and design entrepreneur. Even today there are still too few programmers to meet the demand on the market. So this is still an opportunity to actually get paid for your work.</p>  <p>Whatever you do: Good Luck!</p>",
	"dsq_thread_id":"1000349 https://drewing.de/blog/2018/2/11/so-you-want-to-be-a-designer"
}